RT-Thread/rt-thread/bsp/wch/arm/ch32f203r-evt/board/board.c
void ch32f2_i2c_clock_and_io_init(I2C_TypeDef *i2cx)
{

    GPIO_InitTypeDef GPIO_InitStructure;

    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;

    if (i2cx == I2C1)
    {

        RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9;
        GPIO_Init(GPIOB, &GPIO_InitStructure);
        GPIO_PinRemapConfig(GPIO_Remap_I2C1, ENABLE);
    }

    if (i2cx == I2C2)
    {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
        GPIO_Init(GPIOB, &GPIO_InitStructure);
    }
}

void ch32f2_i2c_config(I2C_TypeDef *i2cx)
{

    I2C_InitTypeDef I2C_InitTSturcture;

    if (i2cx == I2C1)
    {
        I2C_InitTSturcture.I2C_ClockSpeed = 100000;
        I2C_InitTSturcture.I2C_Mode = I2C_Mode_I2C;
        I2C_InitTSturcture.I2C_DutyCycle = I2C_DutyCycle_16_9;
        I2C_InitTSturcture.I2C_OwnAddress1 = 0;
        I2C_InitTSturcture.I2C_Ack = I2C_Ack_Enable;
        I2C_InitTSturcture.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
        I2C_Init(I2C1, &I2C_InitTSturcture);

        I2C_Cmd(I2C1, ENABLE);
        I2C_AcknowledgeConfig(I2C1, ENABLE);
    }

    if (i2cx == I2C2)
    {
        I2C_InitTSturcture.I2C_ClockSpeed = 100000;
        I2C_InitTSturcture.I2C_Mode = I2C_Mode_I2C;
        I2C_InitTSturcture.I2C_DutyCycle = I2C_DutyCycle_16_9;
        I2C_InitTSturcture.I2C_OwnAddress1 = 0;
        I2C_InitTSturcture.I2C_Ack = I2C_Ack_Enable;
        I2C_InitTSturcture.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
        I2C_Init(I2C2, &I2C_InitTSturcture);

        I2C_Cmd(I2C2, ENABLE);
        I2C_AcknowledgeConfig(I2C2, ENABLE);
    }
}

#ifdef BSP_USING_CLOCK_TIMER
void ch32f2_tim_clock_init(TIM_TypeDef *timx)
{
    if (timx == TIM1)
    {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
    }

    if (timx == TIM2)
    {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
    }

    if (timx == TIM3)
    {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
    }

    if (timx == TIM4)
    {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
    }

    if (timx == TIM5)
    {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
    }

    if (timx == TIM6)
    {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
    }

    if (timx == TIM7)
    {
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);
    }

    if (timx == TIM8)
    {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8, ENABLE);
    }

    if (timx == TIM9)
    {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM9, ENABLE);
    }

    if (timx == TIM10)
    {
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM10, ENABLE);
    }
}

rt_uint32_t ch32f2_tim_clock_get(TIM_TypeDef *timx)
{
    RCC_ClocksTypeDef RCC_Clocks;
    rt_uint32_t rcc_cfgr0;
    rt_uint8_t ppre1, ppre2;

    RCC_GetClocksFreq(&RCC_Clocks);

    rcc_cfgr0 = RCC->CFGR0;

    ppre1 = (rcc_cfgr0 >> 8) & 0x7;  // CFGR0[10:8]
    ppre2 = (rcc_cfgr0 >> 11) & 0x7; // CFGR0[13:11]

    if (timx == TIM1 || timx == TIM8 || timx == TIM9 || timx == TIM10)
    {
        return ppre2 >= 4 ? RCC_Clocks.PCLK2_Frequency * 2 : RCC_Clocks.PCLK2_Frequency;
    }

    // TIM2~7
    return ppre1 >= 4 ? RCC_Clocks.PCLK1_Frequency * 2 : RCC_Clocks.PCLK1_Frequency;
}

struct rt_clock_timer_info clock_timer_info1 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info2 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info3 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info4 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info5 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info6 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info7 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info8 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info9 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info clock_timer_info10 =
    {
        .maxfreq = 1000000,
        .minfreq = 2000,
        .maxcnt = 0xFFFF,
        .cntmode = CLOCK_TIMER_CNTMODE_UP,

};

struct rt_clock_timer_info *ch32f2_clock_timer_info_config_get(TIM_TypeDef *timx)
{
    struct rt_clock_timer_info *info = RT_NULL;

    if (timx == TIM1)
    {
        info = &clock_timer_info1;
    }
    else if (timx == TIM2)
    {
        info = &clock_timer_info2;
    }
    else if (timx == TIM3)
    {
        info = &clock_timer_info3;
    }
    else if (timx == TIM4)
    {
        info = &clock_timer_info4;
    }
    else if (timx == TIM4)
    {
        info = &clock_timer_info4;
    }
    else if (timx == TIM5)
    {
        info = &clock_timer_info5;
    }
    else if (timx == TIM6)
    {
        info = &clock_timer_info6;
    }
    else if (timx == TIM7)
    {
        info = &clock_timer_info7;
    }
    else if (timx == TIM8)
    {
        info = &clock_timer_info8;
    }
    else if (timx == TIM9)
    {
        info = &clock_timer_info9;
    }
    else if (timx == TIM10)
    {
        info = &clock_timer_info10;
    }

    return info;
}

